var hyData = {'计算机/互联网/通信/电子':['计算机软件','计算机硬件','计算机服务(系统、数据服务、维修)','通信/电信/网络设备','通信/电信运营、增值服务','互联网/电子商务','网络游戏','电子技术/半导体/集成电路','仪器仪表/工业自动化'],'会计/金融/银行/保险':['会计/审计','金融/投资/证券','银行','保险','信托/担保/拍卖/典当'],
'贸易/消费/制造/营运':['贸易/进出口','批发/零售','快速消费品(食品、饮料、化妆品)','服装/纺织/皮革','家具/家电/玩具/礼品','奢侈品/收藏品/工艺品/珠宝','办公用品及设备','机械/设备/重工','汽车及零配件'],'制药/医疗':
['制药/生物工程','医疗/护理/卫生','医疗设备/器械'],'广告/媒体':['广告','公关/市场推广/会展','影视/媒体/艺术/文化传播','文字媒体/出版','印刷/包装/造纸'],'房地产/建筑':['房地产','建筑/建材/工程','	家居/室内设计/装潢','物业管理/商业中心'],'专业服务/教育/培训':['中介服务','专业服务(咨询、人力资源、财会)','外包服务','检测、认证','法律','教育/培训/院校','学术/科研','租赁服务'],'服务业':['餐饮业','酒店/旅游	娱乐/休闲/体育','美容/保健','生活服务'],'物流/运输':['交通/运输/物流','航天/航空'],'能源/原材料':['石油/化工/矿产/地质','采掘业/冶炼','电气/电力/水利','新能源','原材料和加工'],'政府/非赢利机构/其他':['政府/公共事业','非盈利机构','环保 农/林/牧/渔','多元化业务集团公司'],};
function initHySelect(f,s){
	var f = document.getElementById(f);
    var s = document.getElementById(s),i=0;
	f[i] = new Option("请选择", '-');i++;
	for (var x in hyData) {
		f[i] = new Option(x, x); i++;
	}
}
function selectHynt(v,d){	
	var d = document.getElementById(d),i=0;
	removeOptions(d);	
	d[i] = new Option("请选择", '-');i++;	
	for (var x in hyData) {
		if (x===v) {
			for (var y in hyData[x]) {
				d[i] = new Option(hyData[x][y],hyData[x][y]); i++;
			}
			return false;
		}
	}
}
function removeOptions(s) {
    if ((s != undefined) && (s.options != undefined)) {
        var a = s.options.length;
        for (var b = 0; b < a; b++) {
            s.options[0] = null;
        }
    }
}